changes in the arch diagrams
